Revit 2026 API

# BeamFailures Properties

---

The BuiltInFailuresBeamFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotBendBeamType | Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp. You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve. |

#### Reference

BuiltInFailuresBeamFailures Class

Autodesk.Revit.DB Namespace